In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [6]:
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
file_path

'C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv'

In [7]:
visa_df = pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,Denied
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,Denied
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,Certified
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,Certified
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,Denied
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,Certified
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,Denied
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,Denied
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,Denied

- In Machine Learning Algorithms will develops models by using Maths
 
- Maths allows only numbers
 
- So it is very important, You need to pass numerical data only
 
- So that we need to convert Categorical data to numerical data
 
- For that we have Encoding methods
 
- Encoding

         - Label Encoder
  
               - map method
  
               - np.where
  
               - Label Encoder package from sklearn
  
         - Onehot Encoder
  
               - pds.get_dummies()

- Method - 1  - map

- Read any categorical column : case_status
- Check how many unique labels are there
- Create a dictionary with those unique labels as keys, providing a number as values

In [11]:
visa_df['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

In [16]:
visa_df['case_status'].unique()
dict1 = {'Certified':0,'Denied':1}
visa_df['case_status'].map(dict1)
#1 ========> Certified
#0 ========> Denied

0        1
1        1
2        0
3        0
4        0
        ..
25475    1
25476    0
25477    1
25478    1
25479    1
Name: case_status, Length: 25480, dtype: int64

In [39]:
###################################  Read the Data  ###############################################################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
###################################  Map  #########################################################################
visa_df['case_status'].unique()   #2 that is Certified, Denied
dict1 = {'Certified':0,'Denied':1}
visa_df['case_status'].map(dict1)
#1 ========> Certified
#0 ========> Denied
visa_df['case_status_num'] = visa_df['case_status'].map(dict1)

In [41]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status,case_status_num
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,Denied,1
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,Denied,1
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,Certified,0
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,Certified,0
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,Certified,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,Denied,1
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,Certified,0
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,Denied,1
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,Denied,1
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,Denied,1

**drop the column case_status_num**

In [44]:
visa_df.drop('case_status_num', axis = 1, inplace = True)

In [46]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,Denied
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,Denied
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,Certified
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,Certified
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,Denied
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,Certified
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,Denied
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,Denied
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,Denied

**Overwrite on same column**

In [49]:
###################################  Read the Data  ###############################################################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
###################################  Map  #########################################################################
visa_df['case_status'].unique()   #2 that is Certified, Denied
dict1 = {'Certified':0,'Denied':1}
visa_df['case_status'].map(dict1)
#1 ========> Certified
#0 ========> Denied
visa_df['case_status'] = visa_df['case_status'].map(dict1)

In [51]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,1
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,1
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,0
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,0
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,1
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,0
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,1
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,1
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,1

In [53]:
# Take column "continent"
visa_df['continent'].unique()

array(['North Am', 'Africa', 'Asia', 'Europe'], dtype=object)

In [71]:
# Here we got more than unique labels, so instead of giving manually, we need to do using for loop
labels = visa_df['continent'].unique()
num = len(visa_df['continent'].unique())
dict={}
for i in range(num):
    print(labels[i],i)
####################### Instead of print we can do dict #############################################    
    dict[labels[i]]=i
dict


{labels[i]:i for i in range(num)}     # dictionary comprehension

North Am 0
Africa 1
Asia 2
Europe 3

{'North Am': 0, 'Africa': 1, 'Asia': 2, 'Europe': 3}

In [73]:
{labels[i]:i for i in range(num)}

{'North Am': 0, 'Africa': 1, 'Asia': 2, 'Europe': 3}

In [95]:
###############  Read the data again, cause we already over write it so........  #########################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)

In [97]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,Denied
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,Denied
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,Certified
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,Certified
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,Denied
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,Certified
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,Denied
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,Denied
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,Denied

- np.where is applicable for only binary conditions eg : case_status = 'Certified', 'Denied'
- which means it only applicable for two labels
- np.where(<Cond>,<True_value>,<False_value>)
- For example case_status has two labels
- condition == 'certified'
- True_values = Replace all certified values with 0
- False_values = Replace all Denied values with 1

In [100]:
con1 = visa_df['case_status'] == 'Certified'
np.where(con1,0,1)

array([1, 1, 0, ..., 1, 1, 1])

In [ ]:
# Overwriting
con1 = visa_df['case_status'] == 'Certified'
visa_df['case_status'] = np.where(con1,0,1)
visa_df

$Label Encoder$

- Label Encoder is a method from sklearn
- Under sklearn we have sub modules
- One of the sub modules is : preprocessing
- Any sklearn packages we only 3 steps
- Read the package
- Save the package
- Apply the fit Transform

In [108]:
# Read the package
from sklearn.preprocessing import LabelEncoder
# Save the package
le = LabelEncoder
# fit Transform
le.fit_transform

$fit-transform$
- fit and transform two different definations

# Example
age
1
2
3
4
5

new_age = by adding each observation with mean value: x+mean
mean = 1+2+3+4+5/5=3 =====>fit

new_age ==========> Transform
- 1+3
- 2+3
- 3+3
- 4+3
- 5+3

In [119]:
# Read the package
from sklearn.preprocessing import LabelEncoder
# Save the package
le=LabelEncoder()
# fit Transform
le.fit_transform(visa_df['case_status'])

array([1, 1, 0, ..., 1, 1, 1], dtype=int64)

In [127]:
################  Read the Data again   #############################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa_df['case_status'] = le.fit_transform(visa_df['case_status'])    # Over writing 
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,1
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,1
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,0
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,0
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,1
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,0
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,1
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,1
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,1

In [133]:
################  Read the Data again   #############################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa_df['continent'] = le.fit_transform(visa_df['continent'])    # Over writing 
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,3,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,Denied
1,CASE000002,0,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,Denied
2,CASE000003,3,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,Certified
3,CASE000004,1,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,Certified
4,CASE000005,1,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,2,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,Denied
25476,CASE025477,2,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,Certified
25477,CASE025478,2,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,Denied
25478,CASE025479,2,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,Denied
25479,CASE025480,0,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,Denied

In [148]:
################  Read the Data again   #############################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
##########################   LabelEncode()   ###############################
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa_df['continent'] = le.fit_transform(visa_df['continent']) # Over writing 
visa_df['case_status'] = le.fit_transform(visa_df['case_status'])# Over writing 
print(visa_df[['continent','case_status']].head(10))

   continent  case_status
0          3            1
1          0            1
2          3            0
3          1            0
4          1            0
5          0            1
6          0            1
7          2            0
8          3            1
9          2            0

In [167]:
le.fit_transform(visa_df['continent'][:5])

array([2, 0, 2, 1, 1], dtype=int64)

In [173]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [175]:
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,Denied
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,Denied
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,Certified
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,Certified
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,Denied
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,Certified
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,Denied
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,Denied
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,Denied

**Onehot Encoder**
- One hot Encoder means at a time one will be on (1/True) and another one will be off(0/False)
- Suppose case_status has two unique labels
- "Certified" and "Denied"
- In One hot Encoder, it wil create two new column
- like below
case_status|Certified|Denied|
|----------|---------|------|
Certified|1|0|
Denied|0|1|

**Advantage:**
- One hot Encoder new columns are Orthogonal each other
- Orthoganality means 90 degrees phase shift
- 90 degrees phase shift means perpendicular each other
- perpendicular means independent to each other
- Independent means no relation
- It is very important property that is to avoid relation between variables
- **Draw back:**
- Assume that you have 100 uniwqe labels for a column
- So it will create 100 new columns
- To process 100 columns we require more memory, more time, more Hardware
- This is called **curse of Dimensionality**

**pd.get_dummies**

In [187]:
#######################    Read the data again     #################################
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\Visadataset.csv"
visa_df = pd.read_csv(file_path)
visa_df
pd.get_dummies(visa_df,columns=['case_status'])   # In case_status column it will create 2 new columns called  "case_status_Certified"	"case_status_Denied"
# the values is in [True, False] state, if we want in [0, 1] give dtype = 'int'

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status_Certified,case_status_Denied
0,CASE000001,North Am,Master's,Y,Y,67106,1958,Midwest,37301.639919,Year,N,False,True
1,CASE000002,Africa,Bachelor's,N,Y,8604,1978,South,16595.987276,Year,Y,False,True
2,CASE000003,North Am,Doctorate,N,Y,65892,2004,Midwest,23798.265546,Year,Y,True,False
3,CASE000004,Asia,Master's,Y,N,42916,1957,South,23147.729249,Hour,Y,True,False
4,CASE000005,Asia,Master's,Y,Y,87731,2004,West,40611.953414,Year,Y,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
25475,CASE025476,Europe,High School,N,Y,60678,1969,Northeast,36008.381578,Year,N,False,True
25476,CASE025477,Europe,Bachelor's,Y,N,9687,2004,Midwest,45855.045642,Hour,N,True,False
25477,CASE025478,Europe,Doctorate,Y,N,86477,1976,Midwest,42572.951662,Year,N,False,True
25478,CASE025479,Europe,Master's,Y,Y,87627,1976,West,42016.385579,Year,N,False,True
25479,CASE025480,Africa,High School,N,Y,31939,1996,Northeast,25495.250664,Hour,N,False,True